app/controllers/examiner/categories_controller.rb

  def show
    @category = Category.find params[:id]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @categories = Category.page(params[:page]).per(10)
---
SELECT  "categories".* FROM "categories" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "categories"

  def create
    @category = Category.new category_params
    @categories = Category.all
    if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hoan"], ["description", "hom nay nong qua"], ["created_at", "2015-05-27 17:09:37.966343"], ["updated_at", "2015-05-27 17:09:37.966343"]]

  def edit
    @category = Category.find params[:id]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]