app/controllers/examiner/examinations_controller.rb

  def show
    @examination = Examination.find params[:id]
---
SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @examinations = Examination.page(params[:page]).per(10)
---
SELECT  "examinations".* FROM "examinations" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "examinations"

  def create
    @examination = Examination.new examination_params
    if @examination.save
---
INSERT INTO "examinations" ("name", "description", "time_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ohan"], ["description", "asdf"], ["time_limit", 90], ["created_at", "2015-05-27 17:10:39.106349"], ["updated_at", "2015-05-27 17:10:39.106349"]]

  def edit
    @examination = Examination.find params[:id]
---
SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @examination = Examination.find params[:id]
    @examination.destroy
---
SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "examinations" WHERE "examinations"."id" = ?  [["id", 1]]