app/controllers/examiner/exam_questions_controller.rb

SELECT "questions".* FROM "questions"
SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @questions = Question.all
    @examination = Examination.find params[:id]

SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @examination = Examination.find params[:id]