app/controllers/examiner/questions_controller.rb

SELECT  "type_questions".* FROM "type_questions" WHERE "type_questions"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @question = Question.find params[:id]

SELECT "type_questions".* FROM "type_questions"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @question = Question.new
    @type_questions = TypeQuestion.all
    @category = Category.find params[:category_id]

INSERT INTO "questions" ("category_id", "type_question_id", "content", "answer_key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 1], ["type_question_id", 2], ["content", "1+1"], ["answer_key", "2"], ["created_at", "2015-05-27 17:10:12.530744"], ["updated_at", "2015-05-27 17:10:12.530744"]]
---
  def create
    @question = Question.new question_params
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @question = Question.find params[:id]

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "questions" SET "type_question_id" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["type_question_id", 1], ["updated_at", "2015-06-15 02:35:11.628184"], ["id", 4]]
---
  def update
    @question = Question.find params[:id]
    if @question.update_attributes question_params

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]
---
  def destroy
    @question = Question.find params[:id]
    @question.destroy