app/controllers/examiner/relationships_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @category = Category.find params[:id]

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @category = Category.find params[:id]