app/controllers/examiner/session_examinations_controller.rb

SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @session_examination = SessionExamination.find params[:id]

SELECT  "session_examinations".* FROM "session_examinations" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "session_examinations"
---
  def index
    @session_examinations = SessionExamination.page(params[:page]).per(10)

SELECT "examinations".* FROM "examinations"
---
  def new
    @session_examination = SessionExamination.new
    @examinations = Examination.all

SELECT "examinations".* FROM "examinations"
INSERT INTO "session_examinations" ("name", "examination_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdf"], ["examination_id", 1], ["description", "asdf"], ["created_at", "2015-05-27 17:11:01.138803"], ["updated_at", "2015-05-27 17:11:01.138803"]]
---
  def create
    @session_examination = SessionExamination.new session_exam_params
    @examinations = Examination.all
    if @session_examination.save

SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]
SELECT "examinations".* FROM "examinations"
---
  def edit
    @session_examination = SessionExamination.find params[:id]

SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "session_examinations" SET "name" = ?, "examination_id" = ?, "description" = ?, "updated_at" = ? WHERE "session_examinations"."id" = ?  [["name", "dao quaong hoan"], ["examination_id", 1], ["description", "adsfdaf12"], ["updated_at", "2015-06-09 12:40:25.519994"], ["id", 7]]
---
  def update
    @session_examination = SessionExamination.find params[:id]
    if @session_examination.update_attributes session_exam_params

SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "session_examinations" WHERE "session_examinations"."id" = ?  [["id", 6]]
DELETE FROM "user_session_exams" WHERE "user_session_exams"."id" = ?  [["id", 22]]
---
  def destroy
    @session_examination = SessionExamination.find params[:id]
    @session_examination.destroy