app/controllers/examiner/update_status_session_exams_controller.rb

SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "session_examinations" SET "status" = ?, "updated_at" = ? WHERE "session_examinations"."id" = ?  [["status", "Started"], ["updated_at", "2015-05-27 17:11:21.517685"], ["id", 1]]
---
  def update
    @session_examination = SessionExamination.find params[:id]
    if @session_examination.update_attributes update_status_session_params