app/controllers/examiner/user_session_exams_controller.rb

  def show
    @users = User.all
    @session_examination = SessionExamination.find params[:id]
---
SELECT "users".* FROM "users"
SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @session_examination = SessionExamination.find params[:id]
---
SELECT  "session_examinations".* FROM "session_examinations" WHERE "session_examinations"."id" = ? LIMIT 1  [["id", 1]]