app/views/answer_sheets/new.html.slim

        - if question.is_choice_question?
          - question.sample_answers.each do |option|
            .radio
---
SELECT "sample_answers".* FROM "sample_answers" WHERE "sample_answers"."question_id" = ?  [["question_id", 1]]