app/views/answer_sheets/show.html.slim

    - if answer.question.is_choice_question?
      - answer.question.sample_answers.each do |sample_answer|
        .radio
---
SELECT  "type_questions".* FROM "type_questions" WHERE "type_questions"."id" = ? LIMIT 1  [["id", 2]]
SELECT "answers".* FROM "answers" WHERE "answers"."answer_sheet_id" = ?  [["answer_sheet_id", 1]]
SELECT "sample_answers".* FROM "sample_answers" WHERE "sample_answers"."question_id" = ?  [["question_id", 1]]