app/controllers/admin/users_controller.rb

  def index
    #@users = User.all
    @users = User.page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @user = User.find params[:id]
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]