app/views/examiner/user_session_exams/show.html.slim

              method: :patch do |f|
    = collection_check_boxes(:session_examination, :user_ids, User.all, :id, :name) do |u|
---
SELECT "users".* FROM "users"