app/views/examiner/exam_questions/show.html.slim

SELECT "questions".* FROM "questions"
---
  = form_for :examination, url: examiner_exam_question_path(@examination), method: :patch do |f|
    = collection_check_boxes(:examination, :question_ids, Question.all, :id, :content) do |q|