app/views/examiner/examinations/show.html.slim

SELECT "sample_answers".* FROM "sample_answers" WHERE "sample_answers"."question_id" = ?  [["question_id", 2]]
---
            table class="table table-bordered"
              - question.sample_answers.each do |option|