app/controllers/answer_sheets_controller.rb

  def show
    @answer_sheet = AnswerSheet.find params[:id]
---
SELECT  "answer_sheets".* FROM "answer_sheets" WHERE "answer_sheets"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @answer_sheet = AnswerSheet.new
    @time_info = TimeInfo.find params[:time_info_id]
    user_session_exam = UserSessionExam.find(@time_info.user_session_exam_id)
---
SELECT  "time_infos".* FROM "time_infos" WHERE "time_infos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_session_exams".* FROM "user_session_exams" WHERE "user_session_exams"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

  def create
    @answer_sheet = AnswerSheet.new answer_sheet_params
    @answer_sheet.user_id = current_user.id
    if @answer_sheet.get_examination.is_running?
      if @answer_sheet.save
---
INSERT INTO "answer_sheets" ("user_session_exam_id", "time_info_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_session_exam_id", 3], ["time_info_id", 1], ["user_id", 3], ["created_at", "2015-05-27 17:12:47.353311"], ["updated_at", "2015-05-27 17:12:47.353311"]]
INSERT INTO "answers" ("sample_answer_id", "question_id", "answer_sheet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sample_answer_id", 3], ["question_id", 1], ["answer_sheet_id", 1], ["created_at", "2015-06-04 02:54:47.853216"], ["updated_at", "2015-06-04 02:54:47.853216"]]