app/controllers/time_infos_controller.rb

INSERT INTO "time_infos" ("start_time", "user_session_exam_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["start_time", "2015-05-27 17:12:38.000000"], ["user_session_exam_id", 3], ["created_at", "2015-05-27 17:12:44.272449"], ["updated_at", "2015-05-27 17:12:44.272449"]]
---
  def create
    @time_info = TimeInfo.new time_info_params
    if @time_info.save