app/controllers/users_controller.rb

  def show
    @user = User.find params[:id]
    @user_session_exams = @user.user_session_exams
    @answer_sheets = Kaminari.paginate_array(@user.get_answer_sheets)
      .page(params[:page]).per(5)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "answer_sheets".* FROM "answer_sheets" WHERE "answer_sheets"."user_session_exam_id" = ?  [["user_session_exam_id", 3]]
SELECT "user_session_exams".* FROM "user_session_exams" WHERE "user_session_exams"."user_id" = ?  [["user_id", 1]]