app/views/examiner/relationships/show.html.slim

              method: :patch do |f|
    = collection_check_boxes(:category, :parrent_ids, Category.all, :id,
      :name) do |c|
---
SELECT "categories".* FROM "categories"